
public class Peretasovka extends Main {
	static int [] stoimostArr = {2,2,2,2, 
			3,3,3,3,
			4,4,4,4,
			5,5,5,5,
			6,6,6,6,
			7,7,7,7,
			8,8,8,8,
			9,9,9,9,
			10,10,10,10,
			10,10,10,10,
			10,10,10,10,
			10,10,10,10,
			11,11,11,11};
	static String arr[] = {"двойка бубей","двойка пик","двойка треф","двойка червей", 
			"тройка бубей","тройка пик","тройка треф","тройка червей",
			"четверка бубей","четверка пик","четверка треф","четверка червей",
			"пятерка бубей","пятерка пик","пятерка треф","пятерка червей",
			"шестерка бубей","шестерка пик","шестерка треф","шестерка червей",
			"семерка бубей","семерка пик","семерка треф","семерка червей",
			"восьмерка бубей","восьмерка пик","восьмерка треф","восьмерка червей",
			"девятка бубей","девятка пик","девятка треф","девятка червей",
			"десятка бубей","десятка пик","десятка треф","десятка червей",
			"валет бубей","валет пик","валет треф","валет червей",
			"дама бубей","дама пик","дама треф","дама червей",
			"король бубей","король пик","король треф","король червей",
			"туз бубей","туз пик","туз треф","туз червей"};

	public static void potasuem() {
		String b;
		int l = 0;
		for(int i=0; i<52; i++) {
			int random = (int) ( Math.random() * 52 );
			b = arr[i];
			arr[i] = arr[random];
			arr[random] = b;
			
			l = stoimostArr[i];
			stoimostArr[i] = stoimostArr[random];
			stoimostArr[random] = l;}
	}
	
}

